In [11]:
import pandas as pd
from collections import OrderedDict

In [13]:
friend_list1 = [
    ['name', ['A','B','C']],
    ['age', [20, 30, 40]],
    ['job', ['student','teacher','developer']]
]

friend_list2 = [
    ['A', 20, 'student'],
    ['B', 30, 'developer'],
    ['C', 40, 'teacher']
]

friend_dict_list = [
    {'name' : 'A', 'age' : 20, 'job' : 'student'},
    {'name' : 'B', 'age' : 30, 'job' : 'developer'},
    {'name' : 'C', 'age' : 40, 'job' : 'teacher'}
]

friend_ordered_list = OrderedDict(
    [
        ('name', ['A', 'B', 'C']),
        ('age', [20, 30, 40]),
        ('job', ['student', 'teacher', 'developer'])
    ]
)


df = pd.DataFrame(friend_dict_list)
df.head()

  name  age        job
0    A   20    student
1    B   30  developer
2    C   40    teacher

In [14]:
friend_dict_list = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 10, 'final': 30}
    ]
df = pd.DataFrame(friend_dict_list)
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [15]:
df["total"] = df['midterm'] + df['final']
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [16]:
df['average'] = df['total']/2
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [17]:
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
df['grade'] = grades
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [18]:
def pass_or_fail(row):
    if row != "F":
        return "Pass"
    else:
        return "Fail"

In [19]:
df.grade = df.grade.apply(pass_or_fail)

In [20]:
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [22]:
date_list = [
    {
        "yyyy-mm-dd" : "2000-06-27"
    },
    {
        "yyyy-mm-dd" : "2007-10-27"
    }
]
df = pd.DataFrame(date_list)
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [26]:
def extract_year(row):
    return row.split("-")[0]

In [27]:
df['year'] = df["yyyy-mm-dd"].apply(extract_year)
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [28]:
friend_dict_list = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 10, 'final': 30}
    ]
df = pd.DataFrame(friend_dict_list)
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [32]:
df2 = pd.DataFrame([
    ["Ben", 50, 50]
], columns=["name", "midterm", "final"])
df2.head()

  name  midterm  final
0  Ben       50     50

In [37]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

In [ ]:
df['salary'] = 0
df.head()

In [ ]:
import numpy as np

In [ ]:
df["salary"] = np.where(df["job"]!="student","yes","no")

In [ ]:
df.head()

In [ ]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df